data/sysbench-ext4/sdd1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 160MiB each
20GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      7472.10
    writes/s:                     4981.91
    fsyncs/s:                     4981.91

Throughput:
    read, MiB/s:                  116.75
    written, MiB/s:               77.84

General statistics:
    total time:                          60.0059s
    total number of events:              747357

Latency (ms):
         min:                                  0.00
         avg:                                  3.19
         max:                                 37.00
         95th percentile:                     11.04
         sum:                            2386446.48

Threads fairness:
    events (avg/stddev):           18683.9250/480.47
    execution time (avg/stddev):   59.6612/0.01